ОтображениеГрафов/src/Catalogs/граф_ОформленияШаблонов/граф_ОформленияШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>граф_ОформленияШаблонов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОформления</name>
    <type>
      <types>CatalogRef.граф_ШаблоныЭлементов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>EnumRef.граф_КомпонентыГрафа</types>
    </type>
  </attributes>
</mdclass:Catalog>

ОтображениеГрафов/src/Catalogs/граф_ОформленияШаблонов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	Компонент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипОформления, "Компонент");
	УбратьОбрамляющиеСкобки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УбратьОбрамляющиеСкобки()
	ОписаниеJSON = граф_РаботаСТекстомКлиентСервер.СодержимоеВнутриСкобок(ОписаниеJSON);
КонецПроцедуры
#КонецОбласти

#КонецЕсли
